meat_ingredient = {
  "หมู": [
    "เนื้อหมู",
    "เบคอน",
    "แฮม",
    "หมูยอ",
    "กระดูกหมู",
    "ซี่โครงหมู",
    "หมูกรอบ",
    "เบค่อน",
    "หมูหยอง",
    "หมูแดง",
    "กระดูกอ่อน",
    "โบโลน่า",
    "กากหมู",
    "แคปหมู"
  ],
  "เครื่องใน": ["เครื่องใน"],
  "เนื้อ": ["เนื้อ"],
  "เนื้อสัตว์แปรรูป": ["ไส้กรอก", "กุนเชียง", "แหนม", "ไส้อั่ว", "ฮอตดอก"],
  "หมึก": ["หมึก", "ไข่ปลาหมึก"],
  "ปลา": ["ปลากระป๋อง", "ปลาแผ่น", "ปลาเส้น", "เนื้อปลา", "กระเพาะปลา"],
  "ไก่": [
    "ไข่ไก่",
    "เนื้อไก่",
    "ขาไก่",
    "น้ำจิ้มไก่",
    "ตีนไก่",
    "โครงไก่",
    "ไก่จ๊อ"
  ],
  "กุ้ง": ["กุ้ง", "กุ้งแห้ง", "ไข่กุ้ง", "มันกุ้ง"]
}

meat_ingredient_list = sum([meat_ingredient[x] for x in meat_ingredient],[])