import re

clean_char_regex = r'[^\w\s\(\)\{\}\[\]\/\u0E00-\u0E7F]+|_' # \t \n all special char except \ / _ { } () []

space_regex = r'\s+' # '         ' , ' '

number_regex = r'[\d]+' # 1, 12 , 434

number_with_special_character_regex = r'((?:[\d\u00BC-\u00BE\u2150-\u215E]+(?:\.\d+)?(?:\s*[\/]\s*\d+)?[\u00BC-\u00BE\u2150-\u215E]*)|(?:[\+\-\*])|(?:\.\d+))' 

fraction_regex =r'[\u00BgC-\u00BE\u2150-\u215E]+' # match ½

num_on_start_and_in_parentheses = r"^\d+[.)|\s]*" # prefix 1) 1. 1).

match_in_parentheses = r'\(([^)]+)\)' # (1212)

match_or_word = r'หรือ|\(|\)' # หรือ,(,)
match_phamand_word = r'ประมาณ|\(|\)' # ประมาณ,(,)

tea_spoon = r'ช้อนชา|^ชช|^.ชช|ชช.|ช้นชา|..ช้อนชา|ช้อนชาพูน|tps|นชา|กรัมช้อนชา|ซ้อนชา|tsp|ข้อนชา|ช้อนา|ช้อยชา|ช้อนชา|ts|teaspoon|^ช.ช|ช่อนชา|ช้อนช้า|ช้อชา'

spoon = r'ช้อนกินข้าว|ซอ้น|^ช$|^ช.$|ช้อนพูน|ช้อน(?!ช|โ|ต)|ประมานช้อน|ช้อร(?!ช|โ|ต)'

table_spoon = r'^ชต|ข้อนโต๊ะ|ช้อนโต|้อนโต๊ะ|tbs|^ชข|^.ชต|ชต|ชค|ช้อนโโต๊ะ|ช้อมโต๊ะ|ซ้อนโต๊ะ|^ช.ต|ช่อนโต๊ะ|ช้อนโต็ะ|ชอนโต๊ะ|ช้อรโต๊ะ|ช้อนโต๊ะ|ช้นโต๊ะ|โต๊ะ|ชตพูน|ช้อนแกง|ช้อนตักแกง|ซ้อนโต้ะ'

ladle = r'ทัฟพี|ทับพี|ทัพพี|พับพี'

kilogram = r'กิโลกรัม|kg|^โล|^กก|^ก.ก|^กิโล|KG|กก.'

plate = r'จาน|ชาม'

gram = r'^(?!.*(กิโล|มิลลิ)).*(กรัม|กร้ม|กัม|กรั)|^ก.$|^g$|^g.$|^(?!.*(kilo|milli)).*gram|กระม'

milligram = r'มิลลิกรัม|ml|^มล|ม.ล'

millitre = r'cc|มิลลิลิตร|มิลลิเมตร|mm|ซีซี'

litre = r'^(?!.*(กิโล|มิลลิ)).*ลิตร'

glass = 'แก้ว'

bottle = 'ขวด'

hundred_gram = r'ขีเ|ขีด|ชีด|ขึด|ขีด|ขีด'

hand = r'^(?!.*(หยิม|หยิบ)).*(กำ|มือ|จับ)'

pick = r'หยิบ|หยิม'

lid = r'ฝา'

lobe = r'กรีบ|กลีบ|กีบ|clove|กลับ'

rhizome = r'เหง้า'

oz = r'ออนซ์|oz'

cup = r'ถ้วย|ถวย|^ถต|cup|ถั่วตวง'

dipper = r'กระบวย|กระบวน|ตะบวย'

buble = r'ฟอง|^ฟ.'

min_unit = r'โรยหน้า|สำหรับลวกเส้น|little|ใบโรยหน้า|ปรุงรส|เหยาะๆ|นิด|ถ้าชอบ|เสิร์ฟ|เล็กน้อย|สำหรับ|ให้พอ|พอ|ตามที่มี|กะเอา|เหมาะสม|ตกแต่ง|ถ้ากิน|ถ้า|คลุกเส้นหลังลวก|เหลือ|หากชอบ|ไม่ต้องใส่เยอะมาก'

avg = r'แล้วแต่|.*(ตาม|ความ).*(ชอบ|ใจ|สมควร|ต้องการ)|หน่อย|บาง|ลต|สะดวก|เยอะๆ|ตามฐานะ|เเล้วเเต่|ทั้งหมด|ตามช|ตามจำนวน'

drops = r'เหยาะ|ขะยอก|ขยอก|หยด'

if __name__ == '__main__':
  def is_any_match_regex(x,pattern):
    return any([re.search(pattern, s) for s in x])

  print(is_any_match_regex(['เหยาะๆ ลงไป'],min_unit))