measure = {
  'กำมือ' : 28.35 ,
  'ฝา' : 40,
  'ทัพพี' : 50 ,
  'ขีด' : 100 ,
  'ช้อนโต๊ะ' : 15 ,
  'กรีบ' : 6 ,
  'ถ้วยตวง' : 220 ,
  'เหง้า' : 5 ,
  'ช้อนช้า' : 5 ,
  'กิโลกรัม' : 1000 ,
  'ช้อนแกง' : 15,
  'ช้อนกินข้าว' : 10,
  'กระบวย' : 250,
  'ครึ่งลิตร' : 500,
  'ขวดน้ำ' : 500,
  'ออนซ์' : 28.4,
  'แก้ว' : 480,
  'มิลลิกรัม': 0.001,
  'ลิตร': 1000
}

min_unit = ['โรยหน้า','สำหรับลวกเส้น','little','ใบโรยหน้า']
avg_unit = ['แล้วแต่ปริมาณ','ขนาดชอบ','ตามใจชอบ', 'ตามสมควร','ตามความพอใจ','ตามใจ']